ycsb_logs_hugepage/load.log
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=0
[OVERALL], RunTime(ms), 2210
[OVERALL], Throughput(ops/sec), 678.7330316742082
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 531.0
[CLEANUP], MinLatency(us), 531
[CLEANUP], MaxLatency(us), 531
[CLEANUP], 95thPercentileLatency(us), 531
[CLEANUP], 99thPercentileLatency(us), 531
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 196.49733333333333
[INSERT], MinLatency(us), 41
[INSERT], MaxLatency(us), 5467
[INSERT], 95thPercentileLatency(us), 643
[INSERT], 99thPercentileLatency(us), 915
[INSERT], Return=OK, 1500
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=64
[OVERALL], RunTime(ms), 1510
[OVERALL], Throughput(ops/sec), 993.3774834437086
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1211.0
[CLEANUP], MinLatency(us), 1211
[CLEANUP], MaxLatency(us), 1211
[CLEANUP], 95thPercentileLatency(us), 1211
[CLEANUP], 99thPercentileLatency(us), 1211
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 380.92066666666665
[INSERT], MinLatency(us), 48
[INSERT], MaxLatency(us), 3563
[INSERT], 95thPercentileLatency(us), 1376
[INSERT], 99thPercentileLatency(us), 2022
[INSERT], Return=OK, 1500
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=128
[OVERALL], RunTime(ms), 1514
[OVERALL], Throughput(ops/sec), 990.7529722589168
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 953.0
[CLEANUP], MinLatency(us), 953
[CLEANUP], MaxLatency(us), 953
[CLEANUP], 95thPercentileLatency(us), 953
[CLEANUP], 99thPercentileLatency(us), 953
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 312.2246666666667
[INSERT], MinLatency(us), 58
[INSERT], MaxLatency(us), 4703
[INSERT], 95thPercentileLatency(us), 904
[INSERT], 99thPercentileLatency(us), 1738
[INSERT], Return=OK, 1500
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=192
[OVERALL], RunTime(ms), 1515
[OVERALL], Throughput(ops/sec), 990.0990099009902
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1220.0
[CLEANUP], MinLatency(us), 1220
[CLEANUP], MaxLatency(us), 1220
[CLEANUP], 95thPercentileLatency(us), 1220
[CLEANUP], 99thPercentileLatency(us), 1220
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 260.4073333333333
[INSERT], MinLatency(us), 42
[INSERT], MaxLatency(us), 3335
[INSERT], 95thPercentileLatency(us), 670
[INSERT], 99thPercentileLatency(us), 2049
[INSERT], Return=OK, 1500
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=256
[OVERALL], RunTime(ms), 1509
[OVERALL], Throughput(ops/sec), 994.0357852882704
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 776.0
[CLEANUP], MinLatency(us), 776
[CLEANUP], MaxLatency(us), 776
[CLEANUP], 95thPercentileLatency(us), 776
[CLEANUP], 99thPercentileLatency(us), 776
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 174.13
[INSERT], MinLatency(us), 48
[INSERT], MaxLatency(us), 2629
[INSERT], 95thPercentileLatency(us), 617
[INSERT], 99thPercentileLatency(us), 1257
[INSERT], Return=OK, 1500
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=320
[OVERALL], RunTime(ms), 1510
[OVERALL], Throughput(ops/sec), 993.3774834437086
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 929.0
[CLEANUP], MinLatency(us), 929
[CLEANUP], MaxLatency(us), 929
[CLEANUP], 95thPercentileLatency(us), 929
[CLEANUP], 99thPercentileLatency(us), 929
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 187.14266666666666
[INSERT], MinLatency(us), 38
[INSERT], MaxLatency(us), 4131
[INSERT], 95thPercentileLatency(us), 512
[INSERT], 99thPercentileLatency(us), 1158
[INSERT], Return=OK, 1500
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=384
[OVERALL], RunTime(ms), 1511
[OVERALL], Throughput(ops/sec), 992.7200529450695
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1213.0
[CLEANUP], MinLatency(us), 1213
[CLEANUP], MaxLatency(us), 1213
[CLEANUP], 95thPercentileLatency(us), 1213
[CLEANUP], 99thPercentileLatency(us), 1213
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 278.09
[INSERT], MinLatency(us), 51
[INSERT], MaxLatency(us), 2535
[INSERT], 95thPercentileLatency(us), 734
[INSERT], 99thPercentileLatency(us), 1592
[INSERT], Return=OK, 1500
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=448
[OVERALL], RunTime(ms), 1508
[OVERALL], Throughput(ops/sec), 994.6949602122016
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 365.0
[CLEANUP], MinLatency(us), 365
[CLEANUP], MaxLatency(us), 365
[CLEANUP], 95thPercentileLatency(us), 365
[CLEANUP], 99thPercentileLatency(us), 365
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 272.5486666666667
[INSERT], MinLatency(us), 38
[INSERT], MaxLatency(us), 4255
[INSERT], 95thPercentileLatency(us), 825
[INSERT], 99thPercentileLatency(us), 1466
[INSERT], Return=OK, 1500
/usr/bin/java  -classpath /root/asterinas/YCSB/conf:/root/asterinas/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/root/asterinas/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/asterinas/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/asterinas/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/asterinas/YCSB/redis/target/redis-binding-0.18.0-SNAPSHOT.jar:/root/asterinas/YCSB/redis/target/dependency/commons-pool2-2.4.2.jar:/root/asterinas/YCSB/redis/target/dependency/jedis-2.9.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -P ./ycsb-0.17.0/workloads/workload-custom -p redis.host=10.0.2.15 -threads 1 -target 1000 -p insertstart=512
[OVERALL], RunTime(ms), 1510
[OVERALL], Throughput(ops/sec), 993.3774834437086
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 355.0
[CLEANUP], MinLatency(us), 355
[CLEANUP], MaxLatency(us), 355
[CLEANUP], 95thPercentileLatency(us), 355
[CLEANUP], 99thPercentileLatency(us), 355
[INSERT], Operations, 1500
[INSERT], AverageLatency(us), 128.93266666666668
[INSERT], MinLatency(us), 36
[INSERT], MaxLatency(us), 2459
[INSERT], 95thPercentileLatency(us), 295
[INSERT], 99thPercentileLatency(us), 768
[INSERT], Return=OK, 1500